Repository: wangchong2023/ZhiYu
Catalog: Sources/Localization/Catalogs/AI.xcstrings
Source language: en
Languages: zh_hans, zh_hant

# prompt.system.quiz
source: You are an educational assessment expert. Generate 3 to 5 multiple-choice quiz questions based strictly on the provided content. CRITICAL REQUIREMENT: Randomize the correct answer index (answerIndex) across 0, 1, 2, and 3 for each question. Do NOT always place the correct answer as option A (index 0). Distribute correct answers across A, B, C, D. Output MUST be strict JSON matching this structure: { "quizTitle": "%@", "questions": [ { "id": 1, "question": "Question description?", "options": ["Distractor 1", "Correct core conclusion", "Distractor 2", "Distractor 3"], "answerIndex": 1, "explanation": "Detailed explanation..." } ] } Do NOT wrap in code fences. Output valid JSON only. All options MUST be complete, meaningful sentences derived from the source text.
zh_hans: 你是一名教育测评专家。 请严格基于所给内容生成 3 至 5 道单项选择测试题。 重要要求：每道题的正确选项下标（answerIndex）必须随机分布在 0, 1, 2, 3 中（A/B/C/D 随机分布），严禁所有题目的正确答案固定为第一个选项（如全选 A/index 0）。 输出必须是严格匹配此结构的 JSON： { "quizTitle": "%@", "questions": [ { "id": 1, "question": "具体理论问题描述？", "options": ["干扰项描述一", "正确核心结论说明", "干扰项描述二", "干扰项描述三"], "answerIndex": 1, "explanation": "详细解析说明..." } ] } 切勿用代码块包裹。仅输出合法 JSON。所有选项必须是基于源文本提取的完整、有意义句子。
zh_hant: 你是一名教育测評專家。 請嚴格基於所給內容生成 3 至 5 道單項選擇测試題。 重要要求：每道題的正確選項下標（answerIndex）必须隨機分布在 0, 1, 2, 3 中（A/B/C/D 隨機分布），嚴禁所有題目的正確答案固定為第一個選項（如全選 A/index 0）。 輸出必须是嚴格匹配此結構的 JSON： { "quizTitle": "%@", "questions": [ { "id": 1, "question": "具體理論問題描述？", "options": ["幹扰項描述一", "正確核心結論說明", "幹扰項描述二", "幹扰項描述三"], "answerIndex": 1, "explanation": "詳細解析說明..." } ] } 切勿用程式碼塊包裹。仅輸出合法 JSON。所有選項必须是基於源文本提取的完整、有意义句子。

# prompt.system.infographic
source: You are a senior data visualization expert. Create a professional Mermaid graph TD structure. Always start with '# <Summary Title>'. Do NOT use code fences (```). Only output the Title and the Mermaid code.
zh_hans: 你是一名资深数据可视化专家。 请创建一个专业的 Mermaid graph TD 图表结构。 始终以 '# <总结标题>' 开头。 切勿使用代码块包裹(```)。 仅输出标题和 Mermaid 代码。
zh_hant: 你是一名資深資料可視化專家。 請建立一個專業的 Mermaid graph TD 圖表結構。 始終以 '# <總結標題>' 開頭。 切勿使用程式碼塊包裹(```)。 仅輸出標題和 Mermaid 程式碼。

# prompt.system.report
source: You are a senior analyst and technical report writer. Structure the report with a main title ('# '), abstract/summary, detailed sections ('## '), key findings, and conclusion.
zh_hans: 你是一名资深分析师与技术报告作者。 请按照主标题 ('# ')、摘要说明、详细章节 ('## ')、核心发现与结论结构化生成报告。
zh_hant: 你是一名資深分析師与技術报告作者。 請按照主標題 ('# ')、摘要說明、詳細章節 ('## ')、核心發現与結論結構化生成报告。

# prompt.system.expansion
source: You are a senior knowledge architect and researcher. Provide a deep, insightful expansion of the input content. Requirements: 1. Start with '# <Expanded Title>'. 2. Divide into 3 to 4 topic sections with meaningful headers ('## Core Mechanism', '## Practical Application', '## Future Trends'). 3. Do NOT use generic placeholder titles like 'Detail 1'.
zh_hans: 你是一名资深知识架构师与研究员。 请对输入内容进行深入、有洞察力的扩展。 要求： 1. 以 '# <扩展标题>' 开头。 2. 划分为 3 至 4 个带实质性标题的主题章节 ('## 核心机制与结构解构', '## 实践应用与落地方法', '## 延伸思考与前沿趋势')。 3. 切勿使用像 '细节维度 1' 或 'Detail 1' 这类通用占位标题。
zh_hant: 你是一名資深知識架構師与研究員。 請對輸入內容進行深入、有洞察力的擴展。 要求： 1. 以 '# <擴展標題>' 開頭。 2. 劃分為 3 至 4 個带實質性標題的主題章節 ('## 核心機制与結構解構', '## 實践套用与落地方法', '## 延伸思考与前沿趨勢')。 3. 切勿使用像 '細節維度 1' 或 'Detail 1' 這類通用佔位標題。

# prompt.system.suggestFix
source: You are a Knowledge Base Quality Specialist. Provide precise, actionable suggestions to resolve document quality issues.
zh_hans: 你是一名知识库质量专家。请提供精确、可操作的建议，以解决文档质量缺陷。
zh_hant: 你是一名知識庫質量專家。請提供精確、可操作的建議，以解決文档質量缺陷。

# prompt.system.insightQuestions
source: You are a senior research assistant. Analyze the knowledge repository summaries and propose deep, insightful questions.
zh_hans: 你是一名资深研究助手。请分析知识库摘要，并提出深入、有启发性的研讨问题。
zh_hant: 你是一名資深研究助手。請分析知識庫摘要，並提出深入、有啟發性的研讨問題。

# synthesis.control.instruction.audienceBeginner
source: [Target Audience] Beginner, use clear and plain explanations with necessary background context.
zh_hans: 【目标受众】基础入门，请使用通俗易懂的通俗化表达，适当补充背景说明。

# synthesis.control.instruction.audienceProfessional
source: [Target Audience] Domain expert, maintain professional depth with precise terminology and rigorous logic.
zh_hans: 【目标受众】领域专家，请保持专业深度，使用准确的领域术语与严密逻辑。

# synthesis.control.instruction.audienceExecutive
source: [Target Audience] Executive summary, highlight core business conclusions, strategic values, and decision recommendations.
zh_hans: 【目标受众】管理汇报，重点突出核心业务结论、战略价值与关键决策建议。

# synthesis.control.instruction.toneAcademic
source: [Tone & Style] Academic & rigorous, logically structured.
zh_hans: 【语气风格】学术严谨，论证严密，规范条理。

# synthesis.control.instruction.toneProfessional
source: [Tone & Style] Professional & concise, clear focus.
zh_hans: 【语气风格】干练职场，简洁高效，重点突出。

# synthesis.control.instruction.toneCasual
source: [Tone & Style] Engaging & vivid, easy to read.
zh_hans: 【语气风格】生动风趣，轻松易读，比喻恰当。

# synthesis.control.instruction.customPrompt_%@
source: [Custom Instruction] %@
zh_hans: 【自定义指令】%@

# synthesis.control.instruction.depthConcise_%d_%d
source: [Length Requirement] Concise summary (approx. %1$d-%2$d words), compact structure, straight to key points.
zh_hans: 【篇幅要求】精简提炼（约 %1$d-%2$d 字），结构紧凑，直击要点。

# synthesis.control.instruction.depthStandard_%d_%d
source: [Length Requirement] Standard depth (approx. %1$d-%2$d words), comprehensive analysis, complete structure.
zh_hans: 【篇幅要求】标准深度（约 %1$d-%2$d 字），论述充分，结构完整。

# synthesis.control.instruction.depthDetailed_%d_%d
source: [Length Requirement] Detailed long-form expansion (approx. %1$d-%2$d words), expand multi-dimensional analysis including background, theoretical mechanism, key components, practical applications, and future trends.
zh_hans: 【篇幅要求】详尽长文与深度扩写（约 %1$d-%2$d 字），请展开多维度论述，包含概念背景、理论机制、结构解构、实践落地与前沿延伸，内容务必丰富饱满。

# prompt.enrichTable.system
source: You are a senior data analyst and Markdown formatting expert.
zh_hans: 你是一位资深的数据分析师与 Markdown 排版专家。
zh_hant: 你是一位資深的數據分析師與 Markdown 排版專家。

# prompt.enrichTable.user
source: Please analyze the following Markdown table data and summarize its core insights in no more than 3 sentences. Requirements: 1. Professional and concise language. 2. Do not repeat the data in the table; provide trends or conclusions instead. 3. The summary must start with "> [Data Insight]: " and return only this line. %1$@
zh_hans: 请分析以下 Markdown 表格数据，并用不超过 3 句话总结其核心洞察。 要求： 1. 语言专业、精炼。 2. 不要重复表格中的数据，而是给出趋势或结论。 3. 总结必须以 "> [数据洞察]: " 开头，且只返回这一行。 %1$@
zh_hant: 請分析以下 Markdown 表格數據，並用不超過 3 句話總結其核心洞察。 要求： 1. 語言專業、精煉。 2. 不要重複表格中的數據，而是給出趨勢或結論。 3. 總結必須以 "> [數據洞察]: " 開頭，且只返回這一行。 %1$@

# prompt.enrichImage.system
source: You are a senior visual understanding expert and document optimizer.
zh_hans: 你是一位资深的视觉理解专家与文档优化师。
zh_hant: 你是一位資深的視覺理解專家與文檔優化師。

# prompt.enrichImage.user
source: I have an image whose Alt Text is: "%1$@" The URL of the image is: "%2$@" Please infer the core semantics this image may convey based on the Alt Text, and describe it professionally in one sentence (no more than 50 words). Requirements: 1. Professional and concise language, in an expository style. 2. Do not include uncertain words such as "speculate" or "possibly". 3. Must start with "> [Image Semantics]: " and return only this line.
zh_hans: 我有一张图片，其替代文本 (Alt Text) 是："%1$@" 图片的 URL 是： "%2$@" 请基于此替代文本，想象并推断该图片可能传达的核心语义，并用一句话（不超过 50 字）进行专业描述。 要求： 1. 语言专业、精炼，符合说明文风格。 2. 不要包含“推测”、“可能”等不确定的词汇。 3. 必须以 "> [图片语义]: " 开头，且只返回这一行。
zh_hant: 我有一張圖片，其替代文本 (Alt Text) 是："%1$@" 圖片的 URL 是： "%2$@" 請基於此替代文本，想像並推斷該圖片可能傳達的核心語義，並用一句話（不超過 50 字）進行專業描述。 要求： 1. 語言專業、精煉，符合說明文風格。 2. 不要包含「推測」、「可能」等不確定的詞彙。 3. 必須以 "> [圖片語義]: " 開頭，且只返回這一行。

# prompt.ragEval.judge
source: You are a RAG system evaluation expert. Please evaluate the following AI answer with multi-dimensional scoring (0.0 - 1.0) and assess the relevance of each retrieved source. ## Retrieved document sources (total %2$d, showing first %3$d) %1$@ ## Merged context %4$@ ## User question %5$@ ## AI answer %6$@ ## Scoring requirements 1. faithfulness: Is the answer fully grounded in the context? (1.0 = perfectly faithful) 2. relevance: Does the answer directly address the user question? (1.0 = perfect match) 3. precision: Does the context contain the knowledge needed to answer? (1.0 = perfect coverage) 4. hallucination_rate: Proportion of answer content not supported by context? (0.0 = no hallucination) 5. citation_accuracy: Citation accuracy? (1.0 = fully accurate) 6. relevance_scores: For each retrieved source [0]...[N], label relevance: 0=irrelevant, 1=partially relevant, 2=highly relevant ## Output JSON format { "faithfulness": 0.9, "relevance": 0.8, "precision": 0.85, "hallucination_rate": 0.1, "citation_accuracy": 0.8, "relevance_scores": [2, 1, 0, 2, ...], "reasoning": "brief explanation" }
zh_hans: 你是一个 RAG 系统评估专家。请对以下 AI 回答进行多维评分 (0.0 - 1.0) 并评估各检索源的相关性。 ## 检索到的文档源（共 %2$d 条，仅展示前 %3$d 条） %1$@ ## 合并后的上下文 %4$@ ## 用户问题 %5$@ ## AI 回答 %6$@ ## 评分要求 1. faithfulness: 回答是否完全基于上下文？（1.0 = 完美忠实） 2. relevance: 回答是否直接解决用户问题？（1.0 = 完美匹配） 3. precision: 上下文是否包含回答问题所需的知识？（1.0 = 完美覆盖） 4. hallucination_rate: 回答中无上下文支撑的内容占比？（0.0 = 无幻觉） 5. citation_accuracy: 引用准确度？（1.0 = 完全准确） 6. relevance_scores: 对上述每个检索源 [0]...[N] 标注相关性：0=无关, 1=部分相关, 2=高度相关 ## 输出 JSON 格式 { "faithfulness": 0.9, "relevance": 0.8, "precision": 0.85, "hallucination_rate": 0.1, "citation_accuracy": 0.8, "relevance_scores": [2, 1, 0, 2, ...], "reasoning": "简要说明" }
zh_hant: 你是一個 RAG 系統評估專家。請對以下 AI 回答進行多維評分 (0.0 - 1.0) 並評估各檢索源的相關性。 ## 檢索到的文檔源（共 %2$d 條，僅展示前 %3$d 條） %1$@ ## 合併後的上下文 %4$@ ## 用戶問題 %5$@ ## AI 回答 %6$@ ## 評分要求 1. faithfulness: 回答是否完全基於上下文？（1.0 = 完美忠實） 2. relevance: 回答是否直接解決用戶問題？（1.0 = 完美匹配） 3. precision: 上下文是否包含回答問題所需的知識？（1.0 = 完美覆蓋） 4. hallucination_rate: 回答中無上下文支撐的內容佔比？（0.0 = 無幻覺） 5. citation_accuracy: 引用準確度？（1.0 = 完全準確） 6. relevance_scores: 對上述每個檢索源 [0]...[N] 標註相關性：0=無關, 1=部分相關, 2=高度相關 ## 輸出 JSON 格式 { "faithfulness": 0.9, "relevance": 0.8, "precision": 0.85, "hallucination_rate": 0.1, "citation_accuracy": 0.8, "relevance_scores": [2, 1, 0, 2, ...], "reasoning": "簡要說明" }

# synthesis.fallback.slidesSubtitle
source: ZhiYu AI Native Presentation
zh_hans: 智宇 AI 原生演示文稿
zh_hant: 智宇 AI 原生演示文稿

# synthesis.fallback.expansionPointTitle
source: Knowledge Point Expansion %lld
zh_hans: 知识要点扩展 %lld
zh_hant: 知识要点扩展 %lld

# synthesis.fallback.expansionBullet1
source: Deeply refine the key findings of this topic
zh_hans: 深入提炼该主题的关键发现
zh_hant: 深入提炼该主题的关键发现

# synthesis.fallback.expansionBullet2
source: Cross-validate with knowledge base links
zh_hans: 结合知识库链接进行交叉验证
zh_hant: 结合知识库链接进行交叉验证

# synthesis.fallback.slideBullet1
source: Deepen understanding of core points
zh_hans: 核心要点深化理解
zh_hant: 核心要点深化理解

# synthesis.fallback.slideBullet2
source: Systematically organize knowledge structure
zh_hans: 系统梳理知识结构
zh_hant: 系统梳理知识结构

# synthesis.fallback.coreAnalysis
source: Core Analysis
zh_hans: 核心分析
zh_hant: 核心分析

# synthesis.fallback.summaryReview
source: Summary Review
zh_hans: 总结复盘
zh_hant: 总结复盘

# synthesis.fallback.expansionSection1
source: ## Core Concepts and Theoretical Mechanisms
zh_hans: ## 核心概念与理论机制
zh_hant: ## 核心概念与理论机制

# synthesis.fallback.expansionSection2
source: ## Structure Deconstruction and Key Elements
zh_hans: ## 结构解构与关键要素
zh_hant: ## 结构解构与关键要素

# synthesis.fallback.expansionSection3
source: ## Practical Application and Implementation Methods
zh_hans: ## 实践应用与落地方法
zh_hant: ## 实践应用与落地方法

# synthesis.fallback.expansionSection4
source: ## Extended Thinking and Frontier Trends
zh_hans: ## 延伸思考与前沿趋势
zh_hant: ## 延伸思考与前沿趋势

# synthesis.fallback.expansionBackgroundHeader
source: ## Knowledge Background and Origin Analysis
zh_hans: ## 知识背景与起源分析
zh_hant: ## 知识背景与起源分析

# synthesis.fallback.expansionFiller
source: Around this topic, in practical application scenarios, you can combine knowledge base context for in-depth practice and verification. Through atomic notes and bidirectional link networks, promote non-linear network collisions between different topics and long-term memory consolidation.
zh_hans: 围绕该主题，在实际应用场景中可结合知识库上下文进行深入实践与验证。通过原子化笔记与双向链接网络，促成不同主题之间的非线性网状碰撞与长时记忆巩固。
zh_hant: 围绕该主题，在实际应用场景中可结合知识库上下文进行深入实践与验证。通过原子化笔记与双向链接网络，促成不同主题之间的非线性网状碰撞与长时记忆巩固。

# synthesis.fallback.quizInsufficientTitle
source: %@ - No Questions Available
zh_hans: %@ - 暂无可用题目
zh_hant: %@ - 暂无可用题目

# synthesis.fallback.quizInsufficientQuestion
source: The current content has insufficient information to generate targeted questions. Please add more context or key points and try again.
zh_hans: 当前内容信息量不足，无法生成针对性题目。请补充更多上下文或关键要点后重试。
zh_hant: 当前内容信息量不足，无法生成针对性题目。请补充更多上下文或关键要点后重试。

# synthesis.fallback.quizInsufficientExplanation
source: Analysis: Fallback question. It is recommended to add original content and regenerate.
zh_hans: 解析：回退题目，建议补充原文内容后重新生成。
zh_hant: 解析：回退题目，建议补充原文内容后重新生成。

# aitask.status.failedFormat
source: 任务失败: %@
zh_hant: 任務失敗: %@

# aitask.status.runningFormat
source: 正在执行: %1$@ - %2$@
zh_hant: 正在執行: %1$@ - %2$@

# aitask.status.startingFormat
source: 正在启动: %1$@ (%2$@)
zh_hant: 正在啟動: %1$@ (%2$@)

# chat.aiRunning
source: AI 正在后台运行中...
zh_hant: AI 正在後臺運行中...

# prompt.fixSuggestion
source: 针对知识库健康检查问题提供修复建议。 仅以简洁的中文给出 2-3 行操作步骤，不要废话。
zh_hant: 針對知識庫健康检查問題提供修複建議。 仅以简潔的中文給出 2-3 行操作步骤，不要废話。

# prompt.folding
source: 你是一位知识维护专家。请将以下“新资料”增量式地融合（Fold）进“现有页面内容”中。 要求： 1. 保持页面结构的完整性。 2. 逻辑去重，增量插入。 3. 保持双向链接 [[PageLinks]]。 4. 直接返回最终的 Markdown。
zh_hant: 你是一位知識維护專家。請將以下“新資料”增量式地融合（Fold）進“現有頁面內容”中。 要求： 1. 保持頁面結構的完整性。 2. 逻辑去重，增量插入。 3. 保持雙向链接 [[PageLinks]]。 4. 直接返回最終的 Markdown。

# prompt.potentialLinks
source: 你是一位专业的知识库架构师。 任务：分析给定的文本，识别其中提到的、但尚未标记为 [[链接]] 的现有页面标题。 要求： 1. 仅返回文本中明确提到或高度相关的标题。 2. 以 JSON 数组格式返回，例如: ["标题1", "标题2"] 3. 不要返回任何解释。
zh_hant: 你是一位專業的知識庫架構師。 任務：分析給定的文本，識別其中提到的、但尚未標記為 [[链接]] 的現有頁面標題。 要求： 1. 仅返回文本中明確提到或高度相關的標題。 2. 以 JSON 數組格式返回，例如: ["標題1", "標題2"] 3. 不要返回任何解釋。

# prompt.predictQuestions
source: 根据以下最近的对话历史，预测用户接下来最可能还会问的 3 个相关、简短的问题。 【设计约束】： 1. 必须且只能返回包含 3 个字符串的标准的 JSON 数组，例如：["问题 1", "问题 2", "问题 3"]. 2. 不要包含 markdown 标记代码块 (```json) 或任何解释性文本，只需输出合法的 JSON 格式。 3. 问题应该简明扼要，控制在 15 个字以内，契合用户之前的探究重点。 4. 语言必须与最近对话历史使用的语言保持一致（例如中文）。 【对话历史】： %@
zh_hant: 根據以下最近的對話历史，預测使用者接下來最可能还會問的 3 個相關、简短的問題。 【設计約束】： 1. 必须且隻能返回包含 3 個字符串的標準的 JSON 數組，例如：["問題 1", "問題 2", "問題 3"]. 2. 不要包含 markdown 標記程式碼塊 (```json) 或任何解釋性文本，隻需輸出合法的 JSON 格式。 3. 問題應该简明扼要，控制在 15 個字以內，契合使用者之前的探究重点。 4. 語言必须与最近對話历史使用的語言保持一致（例如中文）。 【對話历史】： %@

# prompt.queryRewrite
source: 你是一位知识检索专家。请分析以下查询并改写为一组检索关键词。 要求： 1. 扩充同义词和专业术语。 2. 仅输出关键词，逗号分隔。
zh_hant: 你是一位知識检索專家。請分析以下查詢並改寫為一組检索關鍵词。 要求： 1. 擴充同义词和專業術語。 2. 仅輸出關鍵词，逗號分隔。

# prompt.refactor
source: 你是一位知识管理专家。分析页面数据，寻找优化结构的机会（合并相似、拆分过大、重命名）。 以 JSON 数组格式返回，对象包含: type, target, reason, suggestion。
zh_hant: 你是一位知識管理專家。分析頁面資料，尋找最佳化結構的機會（合並相似、拆分過大、重命名）。 以 JSON 數組格式返回，對象包含: type, target, reason, suggestion。

# prompt.rerank
source: # Role: 信息检索专家 # Task: 根据相关性对以下文档排序。 # Requirements: 仅返回 JSON 数组格式的排序索引，如: [1, 0, 2]。不要解释。 格式: {"ranked_ids": [...]}
zh_hant: # Role: 資訊检索專家 # Task: 根據相關性對以下文档排序。 # Requirements: 仅返回 JSON 數組格式的排序索引，如: [1, 0, 2]。不要解釋。 格式: {"ranked_ids": [...]}

# prompt.resetConfirm
source: 确认重置
zh_hant: 確認重置

# prompt.resetToDefault
source: 重置为默认指令
zh_hant: 重置為預設指令

# prompt.resetWarning
source: 这将抹除你所有的自定义 Prompt，并恢复为系统预设。
zh_hant: 這將抹除你所有的自訂 Prompt，並恢複為係統預設。
